/* $ObjectName=MAFLogonManagerNG_iOS */
/* $Collection=frwk.tools.ios */
/* $Domain=BC */
/* $Developer=I043975 */
/* $Description=Mobile Application Framework - iOS Reusable Tool Components */

/* XMSG: message */
"keyErrDescrMAFLogonErrorInvalidParameter" = "Ungültiger Parameter.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorInvalidOperationCode" = "Ungültiger Vorgangscode.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorCommunicationManagerError" = "Verbindung zum Server konnte nicht hergestellt werden. Anmeldedaten überprüfen.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorUserAlreadyLoggedIn" = "Benutzer bereits angemeldet.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorOperationExecutionInProgress" = "Vorgang wird bereits ausgeführt.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorInvalidOperationContext" = "Ungültiger Vorgangskontext.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorInvalidCommunicatorId" = "Ungültige ID für Kommunikationsprotokoll.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorInvalidActionItemId" = "Ungültige Aktionselement-ID.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorCouldNotDecideCommunicator" = "Kommunikationsprotokoll konnte nicht ermittelt werden.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorInvalidBackendPassword" = "Prüfen Sie Ihr Kennwort.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorDeviceAlreadyRegistered" = "Dieses Gerät ist bereits für einen anderen Benutzer registriert.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorPasswordsNotEqual" = "Die von Ihnen eingegebenen Codes sind nicht identisch.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorOperationNotAllowed" = "Der Vorgang ist in diesem Zustand nicht zulässig.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorInvalidServerHost" = "Die von Ihnen eingegebenen Anmeldedaten sind unzureichend oder ungültig. Versuchen Sie es erneut.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorResetErrorCheckNetwork" = "App konnte nicht zurückgesetzt werden. Prüfen Sie, ob Sie mit dem Netzwerk verbunden sind.";

/* XMSG */
"keyErrDescrMAFLogonErrorCheckLoginData" = "Verbindung zum Server konnte nicht hergestellt werden. Anmeldedaten überprüfen.";

/* XMSG */
"keyErrDescrMAFLogonErrorCheckUsernamePassword" = "Prüfen Sie Ihren Benutzernamen und Ihr Kennwort.";

/* XMSG */
"keyErrDescrMAFLogonErrorConsultWithAdministrator" = "Verbindung zum Server konnte nicht hergestellt werden. Wenden Sie sich an den Administrator.";

/* XMSG */
"keyErrDescrMAFLogonErrorInvalidLoginData" = "Die von Ihnen eingegebenen Anmeldedaten sind unzureichend oder ungültig. Versuchen Sie es erneut.";

/* XMSG */
"keyErrDescrMAFLogonErrorPasscodeCorrect" = "Geben Sie den richtigen Code ein.";

/* XMSG */
"keyErrDescrMAFLogonErrorPasscodeDigit" = "Geben Sie einen Code ein, der mindestens eine Ziffer enthält.";

/* XMSG */
"keyErrDescrMAFLogonErrorPasscodeDontMatch" = "Die von Ihnen eingegebenen Codes sind nicht identisch.";

/* XMSG */
"keyErrDescrMAFLogonErrorPasscodeExpired" = "Das Kennwort ist abgelaufen. Sie müssen es ändern.";

/* XMSG */
"keyErrDescrMAFLogonErrorPasscodeLength" = "Geben Sie einen Code ein, der mindestens {0} Zeichen enthält.";

/* XMSG */
"keyErrDescrMAFLogonErrorPasscodeLowercase" = "Geben Sie einen Code ein, der mindestens einen Kleinbuchstaben enthält.";

/* XMSG */
"keyErrDescrMAFLogonErrorPasscodeSpecialCharacters" = "Geben Sie einen Code ein, der mindestens ein Sonderzeichen enthält.";

/* XMSG */
"keyErrDescrMAFLogonErrorPasscodeUniqueCharacters" = "Geben Sie einen Code ein, der mindestens {0} eindeutige Zeichen enthält.";

/* XMSG */
"keyErrDescrMAFLogonErrorPasscodeUppercase" = "Geben Sie einen Code ein, der mindestens einen Großbuchstaben enthält.";

/* XMSG */
"keyErrDescrMAFLogonErrorCertificateKeyGeneration" = "Schlüssel für Zertifikat konnte nicht abgerufen werden.";

/* XMSG */
"keyErrDescrMAFLogonErrorCertificateGeneration" = "Zertifikat konnte nicht abgerufen werden.";

/* XMSG */
"keyErrDescrMAFLogonErrorAppSettingsValidation" = "Application Setting property validation failed for key:";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorUnknown" = "Unbekannter Fehler";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorAlreadyExists" = "Sicherer Speicher ist bereits vorhanden";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorDataTypeError" = "Datentypfehler";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorDoesNotExist" = "Sicherer Speicher ist nicht vorhanden";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorInvalidArg" = "Ungültiges Argument";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorInvalidPassword" = "Geben Sie den richtigen Code ein.";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorLocked" = "Sicherer Speicher ist gesperrt";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorOutOfMemory" = "Kapazität des sicheren Speichers erschöpft";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorPasswordExpired" = "Das Kennwort ist abgelaufen. Sie müssen es ändern.";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorPasswordRequired" = "Geben Sie einen Code ein, der mindestens {0} eindeutige Zeichen enthält.";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorPasswordRequiresDigit" = "Geben Sie einen Code ein, der mindestens eine Ziffer enthält.";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorPasswordRequiresLower" = "Geben Sie einen Code ein, der mindestens einen Kleinbuchstaben enthält.";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorPasswordRequiresSpecial" = "Geben Sie einen Code ein, der mindestens ein Sonderzeichen enthält.";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorPasswordRequiresUpper" = "Geben Sie einen Code ein, der mindestens einen Großbuchstaben enthält.";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorPasswordUnderMinLength" = "Geben Sie einen Code ein, der mindestens {0} Zeichen enthält.";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorPasswordUnderMinUniqueChars" = "Geben Sie einen Code ein, der mindestens {0} eindeutige Zeichen enthält.";

/* XMSG */
"keyErrDescrMAFSecureStoreManagerErrorDeleted" = "Sicherer Speicher wurde gelöscht.";

/* XMSG */
"keyErrDescrMAFLogonErrorOperationNotSupported" = "Vorgang wird nicht unterstützt.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorInvalidMCIMSSOPin" = "Ungültiger SSO-Code.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorAfariaInvalidCredentials" = "Ungültige Afaria-Anmeldeinformationen.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorClientIdentityNotFound" = "Client-Identität nicht gefunden";

/* XMSG: message */
"keyErrDescrMAFLogonErrorURLValidationFailed" = "Zugriff verweigert";

/* XMSG: message */
"keyErrDescrMAFLogonErrorXMLParserInitializationError" = "Cannot instantiate the xml parser.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorXMLParserError" = "Error during xml parsing.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorSettingsDownloadFailed" = "Settings download failed.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorHTTPDomainError" = "HTTP domain error with response status:";

/* XMSG: message */
"keyErrDescrMAFLogonErrorInvalidJSONData" = "JSON data is invalid";

/* XMSG: message */
"keyErrDescrMAFLogonErrorJSONParserError" = "Error during json parsing";

